In [38]:
from pandas import *
from numpy import *

In [2]:
df1 = DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [6, 7, 8, 9, 10],
    'C': [11, 12, 13, 14, 15]
})

In [3]:
df2 = DataFrame({
    'A': [11, 22, 33, 44, 55],
    'B': [66, 77, 88, 99, 101],
    'C': [111, 122, 133, 144, 155]
})

In [4]:
df3 = DataFrame({
    'A': [10, 20, 30, 40, 50],
    'B': [60, 70, 80, 90, 100],
    'C': [110, 120, 130, 140, 150]
})

In [5]:
df = concat([df1, df2, df3])

In [6]:
df

    A    B    C
0   1    6   11
1   2    7   12
2   3    8   13
3   4    9   14
4   5   10   15
0  11   66  111
1  22   77  122
2  33   88  133
3  44   99  144
4  55  101  155
0  10   60  110
1  20   70  120
2  30   80  130
3  40   90  140
4  50  100  150

In [7]:
df['A'].sum()

330

In [8]:
concat([df1,df2,df3], axis = 1)

   A   B   C   A    B    C   A    B    C
0  1   6  11  11   66  111  10   60  110
1  2   7  12  22   77  122  20   70  120
2  3   8  13  33   88  133  30   80  130
3  4   9  14  44   99  144  40   90  140
4  5  10  15  55  101  155  50  100  150

In [9]:
left = DataFrame({
    'A': [1, 2, 3],
    'B': [6, 7, 8],
    'key': ['k0', 'k1', 'k2']
})

In [10]:
left

   A  B key
0  1  6  k0
1  2  7  k1
2  3  8  k2

In [11]:
right = DataFrame({
    'A': [11, 22, 33],
    'B': [66, 77, 88],
    'key': ['k0', 'k1', 'k2']
})

In [12]:
right

    A   B key
0  11  66  k0
1  22  77  k1
2  33  88  k2

In [13]:
merge(left, right, how='inner', on='key') # how is inner by default.

   A_x  B_x key  A_y  B_y
0    1    6  k0   11   66
1    2    7  k1   22   77
2    3    8  k2   33   88

In [14]:
left1 = DataFrame({
    'key1':['KO','KO','K1','K2'],
    'key2':['k0','K1','K0','K1'],
    'A':[1,2,3,4],
    'B':[5,6,7,8]
})

In [15]:
left1

  key1 key2  A  B
0   KO   k0  1  5
1   KO   K1  2  6
2   K1   K0  3  7
3   K2   K1  4  8

In [16]:
right1 = DataFrame({
    'key1':['KO','K1','K1','K2'],
    'key2':['k0','K0','K0','K0'],
    'C':[11,22,33,44],
    'D':[55,66,77,88]
})

In [17]:
right1

  key1 key2   C   D
0   KO   k0  11  55
1   K1   K0  22  66
2   K1   K0  33  77
3   K2   K0  44  88

In [18]:
merge(left1,right1,how='inner',on=['key1','key2'])

  key1 key2  A  B   C   D
0   KO   k0  1  5  11  55
1   K1   K0  3  7  22  66
2   K1   K0  3  7  33  77

In [19]:
merge(left1,right1,how='outer',on=['key1','key2'])

  key1 key2    A    B     C     D
0   KO   k0  1.0  5.0  11.0  55.0
1   KO   K1  2.0  6.0   NaN   NaN
2   K1   K0  3.0  7.0  22.0  66.0
3   K1   K0  3.0  7.0  33.0  77.0
4   K2   K1  4.0  8.0   NaN   NaN
5   K2   K0  NaN  NaN  44.0  88.0

In [20]:
merge(left1,right1,how='left',on=['key1','key2'])

  key1 key2  A  B     C     D
0   KO   k0  1  5  11.0  55.0
1   KO   K1  2  6   NaN   NaN
2   K1   K0  3  7  22.0  66.0
3   K1   K0  3  7  33.0  77.0
4   K2   K1  4  8   NaN   NaN

In [21]:
merge(left1,right1,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   KO   k0  1.0  5.0  11  55
1   K1   K0  3.0  7.0  22  66
2   K1   K0  3.0  7.0  33  77
3   K2   K0  NaN  NaN  44  88

In [22]:
left2 = DataFrame({
    'A':[1,2,3],
    'B':[4,5,6]},
    index = ['k0','k1','k2']
)

In [23]:
right2 = DataFrame({
    'C':[11,22,33],
    'D':[44,55,66]},
    index=['K0','K2','K3']
)

In [24]:
left2

    A  B
k0  1  4
k1  2  5
k2  3  6

In [25]:
right2

     C   D
K0  11  44
K2  22  55
K3  33  66

In [26]:
left2.join(right2, how = 'outer')

      A    B     C     D
K0  NaN  NaN  11.0  44.0
K2  NaN  NaN  22.0  55.0
K3  NaN  NaN  33.0  66.0
k0  1.0  4.0   NaN   NaN
k1  2.0  5.0   NaN   NaN
k2  3.0  6.0   NaN   NaN

In [27]:
right2.join(left2)

     C   D   A   B
K0  11  44 NaN NaN
K2  22  55 NaN NaN
K3  33  66 NaN NaN

In [28]:
data = DataFrame({
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
})

In [30]:
data

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [29]:
data.pivot_table(values = 'D', index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [32]:
#index level
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
heir_index = list(zip(outside, inside))
heir_index1 = MultiIndex.from_tuples(heir_index)

In [33]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [34]:
heir_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [35]:
heir_index1

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [39]:
f = DataFrame(random.randn(5,4), heir_index1, ['A', 'B']) # check this error.

ValueError: Shape of passed values is (5, 4), indices imply (6, 2)

In [42]:
df = DataFrame(random.randn(6,2), heir_index1, ['A', 'B'])

In [43]:
df

             A         B
G1 1  0.501704  1.725739
   2 -1.309678  0.417021
   3 -0.776155  0.032737
G2 1  0.998852 -0.915647
   2  0.128675 -0.006735
   3  1.130868 -2.695488

In [44]:
df.loc['G1']

          A         B
1  0.501704  1.725739
2 -1.309678  0.417021
3 -0.776155  0.032737

In [45]:
df.loc['G1'].loc[1]

A    0.501704
B    1.725739
Name: 1, dtype: float64

In [46]:
df.index.names

FrozenList([None, None])

In [47]:
df.index.names = ['Groups', 'Num']

In [48]:
df

                   A         B
Groups Num
G1     1    0.501704  1.725739
       2   -1.309678  0.417021
       3   -0.776155  0.032737
G2     1    0.998852 -0.915647
       2    0.128675 -0.006735
       3    1.130868 -2.695488

In [49]:
df.xs(1,level = 'Num') # this can be done by loc but it is tricky.

               A         B
Groups
G1      0.501704  1.725739
G2      0.998852 -0.915647